In [23]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [24]:
%sql sqlite:///newdb.db

In [25]:
%%sql
DROP TABLE employees;
CREATE TABLE employees (
    id INT PRIMARY KEY,
    name VARCHAR(50),
    salary DECIMAL(10,2)
);

 * sqlite:///newdb.db
Done.
Done.

[]

In [26]:
%%sql
INSERT INTO employees VALUES 
(1, 'Riya', 55000),
(2, 'John', 60000),
(3,'Alice',50000),
(4,'Bishal',32000),
(5,'Kabita',45000);

 * sqlite:///newdb.db
5 rows affected.

[]

* Select Operation

selects data from a database

In [27]:
%%sql
SELECT * FROM employees

 * sqlite:///newdb.db
Done.

[(1, 'Riya', 55000),
 (2, 'John', 60000),
 (3, 'Alice', 50000),
 (4, 'Bishal', 32000),
 (5, 'Kabita', 45000)]

* Where Operation

Filters rows based on a condition.

In [28]:
%%sql
SELECT*FROM employees
WHERE salary>55000;

 * sqlite:///newdb.db
Done.

[(2, 'John', 60000)]

* SQL ORDER BY

Sorts results in ascending or descending.

In [29]:
%%sql
SELECT * FROM employees
ORDER BY salary DESC;

 * sqlite:///newdb.db
Done.

[(2, 'John', 60000),
 (1, 'Riya', 55000),
 (3, 'Alice', 50000),
 (5, 'Kabita', 45000),
 (4, 'Bishal', 32000)]

* SQL AND

Returns rows where both conditions are true.

In [30]:
%%sql
SELECT * FROM employees
WHERE salary > 50000 AND id = 1;

 * sqlite:///newdb.db
Done.

[(1, 'Riya', 55000)]

* SQL OR

Returns rows where at least one condition is true

In [31]:
%%sql
SELECT * FROM employees
WHERE salary = 55000 OR salary = 60000;

 * sqlite:///newdb.db
Done.

[(1, 'Riya', 55000), (2, 'John', 60000)]

* SQL NOT

Used in combination with other operators to give the opposite result(also known as negative result)

In [32]:
%%sql
SELECT * FROM employees
WHERE NOT salary = 55000;

 * sqlite:///newdb.db
Done.

[(2, 'John', 60000),
 (3, 'Alice', 50000),
 (4, 'Bishal', 32000),
 (5, 'Kabita', 45000)]

* SQL INSERT INTO

Adds new records

In [36]:
%%sql 
INSERT INTO employees VALUES (3, 'Alice', 50000);

 * sqlite:///newdb.db
(sqlite3.IntegrityError) UNIQUE constraint failed: employees.id
[SQL: INSERT INTO employees VALUES (3, 'Alice', 50000);]
(Background on this error at: https://sqlalche.me/e/20/gkpj)

* Avoid inserting duplicates (use ignore)

In [37]:
%%sql
INSERT OR IGNORE INTO employees VALUES (3, 'Alice', 50000);

 * sqlite:///newdb.db
0 rows affected.

[]

* Update existing row instead

In [38]:
%%sql
UPDATE employees
SET name = 'Alice', salary = 50000
WHERE id = 3;

 * sqlite:///newdb.db
1 rows affected.

[]

* to replace the existing row

In [39]:
%%sql 
INSERT OR REPLACE INTO employees VALUES (3, 'Alice', 50000);

 * sqlite:///newdb.db
1 rows affected.

[]

* If you want to insert new person

In [40]:
%%sql 
INSERT INTO employees VALUES (6, 'Aman', 50000);

 * sqlite:///newdb.db
1 rows affected.

[]

* SQL NULL VALUES

Find rows where a column is NULL

In [41]:
%%sql
SELECT * FROM employees
WHERE salary IS NULL;

 * sqlite:///newdb.db
Done.

[]

Find NOT NULL salary

In [44]:
%%sql
SELECT * FROM employees
WHERE salary IS NOT NULL
ORDER BY id ASC;

 * sqlite:///newdb.db
Done.

[(1, 'Riya', 55000),
 (2, 'John', 60000),
 (3, 'Alice', 50000),
 (4, 'Bishal', 32000),
 (5, 'Kabita', 45000),
 (6, 'Aman', 50000)]

* SQL UPDATE

In [45]:
%%sql
UPDATE employees
SET salary = 35000
WHERE id = 4;

 * sqlite:///newdb.db
1 rows affected.

[]

* SQL Delete

In [46]:
%%sql 
DELETE FROM employees
WHERE id = 5;

 * sqlite:///newdb.db
1 rows affected.

[]

* SQL SELECT TOP

SQLite/MYSQL version uses LIMIT

In [48]:
%%sql
SELECT * FROM employees
LIMIT 3;

 * sqlite:///newdb.db
Done.

[(1, 'Riya', 55000), (2, 'John', 60000), (4, 'Bishal', 35000)]

* SQL Aggregate Functions

In [49]:
%%sql
SELECT SUM(salary) AS total_salary FROM employees;

 * sqlite:///newdb.db
Done.

[(250000,)]

In [50]:
%%sql
SELECT AVG(salary) AS avg_salary FROM employees;

 * sqlite:///newdb.db
Done.

[(50000.0,)]

In [51]:
%%sql
SELECT COUNT(*) AS total_employees FROM employees;

 * sqlite:///newdb.db
Done.

[(5,)]

* MIN & MAX

In [52]:
%%sql
SELECT MIN(salary) AS lowest_salary,
       MAX(salary) AS highest_salary
FROM employees;

 * sqlite:///newdb.db
Done.

[(35000, 60000)]

* SQL Count

In [53]:
%%sql
SELECT COUNT(*) FROM employees;

 * sqlite:///newdb.db
Done.

[(5,)]

In [54]:
%%sql 
SELECT COUNT(*) FROM employees
WHERE salary > 45000;

 * sqlite:///newdb.db
Done.

[(4,)]

* SQL SUM

In [55]:
%%sql
SELECT SUM(salary) FROM employees;

 * sqlite:///newdb.db
Done.

[(250000,)]

* SQL Avg

In [56]:
%%sql
SELECT AVG(salary) FROM employees;

 * sqlite:///newdb.db
Done.

[(50000.0,)]

* SQL Like

In [57]:
%%sql
SELECT * FROM employees
WHERE name LIKE 'A%';

 * sqlite:///newdb.db
Done.

[(3, 'Alice', 50000), (6, 'Aman', 50000)]

In [59]:
%%sql 
SELECT * FROM employees
WHERE name LIKE '%a';

 * sqlite:///newdb.db
Done.

[(1, 'Riya', 55000)]

* SQL WILDCARDS

 %=0 or more characters
 _=exactly 1 character

In [60]:
%%sql
SELECT * FROM employees
WHERE name LIKE '_____';

 * sqlite:///newdb.db
Done.

[(3, 'Alice', 50000)]

* SQL In

In [61]:
%%sql
SELECT * FROM employees
WHERE salary IN (32000, 50000);

 * sqlite:///newdb.db
Done.

[(3, 'Alice', 50000), (6, 'Aman', 50000)]

* SQL BETWEEN

In [63]:
%%sql
SELECT * FROM employees
WHERE salary BETWEEN 40000 AND 60000;

 * sqlite:///newdb.db
Done.

[(1, 'Riya', 55000),
 (2, 'John', 60000),
 (3, 'Alice', 50000),
 (6, 'Aman', 50000)]

* SQL Aliases

In [64]:
%%sql 
SELECT name AS employee_name,
       salary AS monthly_salary
FROM employees;

 * sqlite:///newdb.db
Done.

[('Riya', 55000),
 ('John', 60000),
 ('Bishal', 35000),
 ('Alice', 50000),
 ('Aman', 50000)]

Alias for table

In [65]:
%%sql
SELECT e.name, e.salary
FROM employees AS e;

 * sqlite:///newdb.db
Done.

[('Riya', 55000),
 ('John', 60000),
 ('Bishal', 35000),
 ('Alice', 50000),
 ('Aman', 50000)]